Revit 2027 API
ScheduleDefinition.IncludeLinkedFiles Property
 Indicates if the schedule includes elements from linked files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeLinkedFiles { get; set; }
Public Property IncludeLinkedFiles As Boolean
	Get
	Set
public:
property bool IncludeLinkedFiles {
	bool get ();
	void set (bool value);
}
member IncludeLinkedFiles : bool with get, set
Property Value
Boolean
 True if elements in linked files should be included, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: This ScheduleDefinition does not support including elements from linked files. -or- When setting this property: This ScheduleDefinition is an embedded ScheduleDefinition.
Remarks
 For an embedded ScheduleDefinition, this setting is controlled by the primary ScheduleDefinition and cannot be set in the embedded ScheduleDefinition.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace